# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
## YOLOv5s-p234 summary: 243 layers, 2231933 parameters, 2231933 gradients, 15.9 GFLOPs

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, SPPF, [512, 5]],  # 7, /16
  ]

# YOLOv5 v6.0 head with (P2, P3, P4) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],  
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #9, /8
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 11

   [-1, 1, Conv, [128, 1, 1]],  #12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #13, /4
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 1, C3, [128, False]],  # 15 (P2/4-xsmall)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4)
  ]
